package main

import (
	"fmt"
	"io/ioutil"
	"net/http"
	"strings"
)

func main() {
	//data := "{\"action\":1,\"id\":6,\"conf\":[{\"group\":\"测试\",\"keywords\":[{\"keyword\":\"麻将\",\"text\":\"http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe\",\"image\":\"http://weixin.xoyo.com/award/images/logo.png\"}]}]}"
	//data := "{\"action\":1,\"id\":2,\"conf\":[{\"group\":\"测试\",\"wlm_text\":\"欢迎新人${username}入群\",\"wlm_image\":\"http://weixin.xoyo.com/award/images/logo.png\",\"keywords\":[{\"keyword\":\"麻将\",\"text\":\"http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe\",\"image\":\"http://weixin.xoyo.com/award/images/logo.png\"},{\"keyword\":\"打牌\",\"text\":\"关键词2号\",\"image\":\"\"}]}]}"
	//data := "{\"action\":1,\"id\":2,\"conf\":[{\"nickname\":\"测试\",\"type\":101,\"wlm_text\":\"欢迎${username}，我是何厚铧\",\"wlm_image\":\"http://weixin.xoyo.com/award/images/logo.png\",\"keywords\":[{\"keyword\":\"麻将\",\"text\":\"http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe\",\"image\":\"http://weixin.xoyo.com/award/images/logo.png\"},{\"keyword\":\"打牌\",\"text\":\"关键词2号\",\"image\":\"\"}]},{\"nickname\":\"\",\"type\":102,\"wlm_text\":\"欢迎${username}，我是何厚铧\",\"wlm_image\":\"http://weixin.xoyo.com/award/images/logo.png\",\"keywords\":[{\"keyword\":\"麻将\",\"text\":\"双人麻将\",\"image\":\"http://weixin.xoyo.com/award/images/logo.png\"},{\"keyword\":\"打牌\",\"text\":\"关键词2号\",\"image\":\"\"}]}]}"
	//data := "{\"action\":1,\"id\":2,\"conf\":[{\"nickname\":\"测试1\",\"type\":101,\"keywords\":[{\"keyword\":\"下载\",\"text\":\"游戏下载：http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe\"},{\"keyword\":\"游戏\",\"text\":\"游戏下载：http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe\"},{\"keyword\":\"管理员\",\"text\":\"现在有事，私聊我，等下回复你！😘\"},{\"keyword\":\"结算\",\"text\":\"私聊我，我来处理😘😘😘\"},{\"keyword\":\"草\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"操\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"鬼\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"妈\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"圈子\",\"text\":\"切换广东推倒胡，加入圈子号“16107”\"},{\"keyword\":\"群规\",\"text\":\"👉【约牌群规】📣本群是专打2元1分广东推倒胡麻将（白板癞子），4码8局一圈一结算，每圈大赢家支付房费5元（发红包标注房费，10元以下免收）📣新人进群请将“群呢称”、“游戏呢称”设一致，打牌请联系管理员切换广东推倒胡，加入圈子号“16107”📣结账采用扫微信支付码方式，大赢家分享游戏账单，输家统一支付大赢家，大赢家支付小赢家。📣打牌心平气和，勿在群内争吵，勿抢群内红包投诉戳→管理员\"},{\"keyword\":\"怎么玩\",\"text\":\"👉【约牌群规】📣本群是专打2元1分广东推倒胡麻将（白板癞子），4码8局一圈一结算，每圈大赢家支付房费5元（发红包标注房费，10元以下免收）📣新人进群请将“群呢称”、“游戏呢称”设一致，打牌请联系管理员切换广东推倒胡，加入圈子号“16107”📣结账采用扫微信支付码方式，大赢家分享游戏账单，输家统一支付大赢家，大赢家支付小赢家。📣打牌心平气和，勿在群内争吵，勿抢群内红包投诉戳→管理员\"}],\"wlm_text\":\"🌷🌷🌷欢迎新人${username}加入我们麻友大家庭👉【游戏下载】http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe👉【加入圈子】广麻2元群圈子🆔16107👉【约牌群规】📣本群是专打2元1分（账单分数*2结算）广东推倒胡麻将（白板癞子），4码8局一圈一结算，每圈大赢家支付房费5元（发红包标注房费，10元以下免收）📣新人进群请将“群呢称”、“游戏呢称”设一致，打牌请联系管理员切换广东推倒胡，加入圈子号“16107”📣结账采用扫微信支付码方式，大赢家分享游戏账单，输家统一支付大赢家，大赢家支付小赢家。📣打牌心平气和，勿在群内争吵，投诉戳→管理员\"},{\"nickname\":\"\",\"type\":102,\"keywords\":[{\"keyword\":\"下载\",\"text\":\"游戏下载：http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe\"},{\"keyword\":\"游戏\",\"text\":\"游戏下载：http://qyq.xoyo.com/h5/download/?app_id=XYd0ogCwfB4wYCqdikYooVe\"},{\"keyword\":\"管理员\",\"text\":\"现在有事，私聊我，等下回复你！😘\"},{\"keyword\":\"结算\",\"text\":\"私聊我，我来处理😘😘😘\"},{\"keyword\":\"草\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"操\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"鬼\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"妈\",\"text\":\"良好的心态才是输赢的关键🀄🀄🀄\"},{\"keyword\":\"圈子\",\"text\":\"切换广东推倒胡，加入圈子号“16107”\"},{\"keyword\":\"群规\",\"text\":\"👉【约牌群规】📣本群是专打2元1分广东推倒胡麻将（白板癞子），4码8局一圈一结算，每圈大赢家支付房费5元（发红包标注房费，10元以下免收）📣新人进群请将“群呢称”、“游戏呢称”设一致，打牌请联系管理员切换广东推倒胡，加入圈子号“16107”📣结账采用扫微信支付码方式，大赢家分享游戏账单，输家统一支付大赢家，大赢家支付小赢家。📣打牌心平气和，勿在群内争吵，勿抢群内红包投诉戳→管理员\"},{\"keyword\":\"怎么玩\",\"text\":\"👉【约牌群规】📣本群是专打2元1分广东推倒胡麻将（白板癞子），4码8局一圈一结算，每圈大赢家支付房费5元（发红包标注房费，10元以下免收）📣新人进群请将“群呢称”、“游戏呢称”设一致，打牌请联系管理员切换广东推倒胡，加入圈子号“16107”📣结账采用扫微信支付码方式，大赢家分享游戏账单，输家统一支付大赢家，大赢家支付小赢家。📣打牌心平气和，勿在群内争吵，勿抢群内红包投诉戳→管理员\"}]}]}"
	data := `{"action":1,"id":2,"conf":[{"nickname":"测试1","type":101,"keywords":[{"keyword":"妮可","text":"大家好，我是妮可，想打麻将的自己进入房间，在群里喊人就好啦，群里打麻将的非常非常多，耐心等待，就有人来啦！"},{"keyword":"开房","text":"群内只允许在圈内打牌，目前圈内的4人房间有28129  三人房有74259 19695 62137 36456 31040 52552 14667"},{"keyword":"群规","text":"在“牌友圈”搜索ID“18774”申请加入，另：\n1.本群为牌乐门小额押金群，只打一毛一分白板麻将，群内打其他金额发生跑单现象概不退款。每8局结算，概不赊账。赊账者扣除押金T群处理。补齐欠款才可进群游戏。\n2.任何形式打“兄弟牌”，一经发现将踢群扣除押金.输钱后乱说别人作弊打通牌的不发图和证据并私自在群里乱说一通捣乱的一经发现立刻踢群扣除押金。\n3.请将“群昵称”和“游戏昵称”设为一致，方便识别，造成收付款出错后果自负。\n4.结账采用扫码支付，输家都统一扫给大赢家，大赢家支付5毛房费，大赢家扫给小赢家。群内禁止红包结算！\n5.不要私下同意任何人的欠帐。被跑单请第一时间发图说，我会负责。私下欠帐造成的损失，自行承担。\n6.游戏结束后，继续玩的请别退房间，不玩的请第一时间退出房间让别人进来。\n7.任何人中途挂机5分钟以上或者需中途退出，其他三家投票结算游戏，按最终系统结算的截图结算。\n8.群内再发其他圈外房间和其他游戏的，一次警告二次T群扣除押金\n9.群内只允许在圈内打牌，目前圈内的4人房间有28129 82181 三人房有74259 19695 62137 36456"},{"keyword":"打牌","text":"本群为牌乐门广东麻将诚信群【圈子18774】 ，欢迎大家来约牌\n【玩法】正宗推倒胡1底分6个码1分一毛，每8把按照输赢分数结算^O^\n【押金】新人进群交押金5元，退群退押金\n【结算】所有输家转账给大赢家，大赢家转账给其他赢家。全部扫码支付\n【房费】每局结束大赢家支付5毛房费，2元以下免收（含）\n下载地址：http://dwz.mn/AU"},{"keyword":"房费","text":"请大赢家扫描上面的二维码自觉交房费给群主！","image":"http://120.92.52.210:8000/storage/app/upload/1f5/2c1/ce9/李婕收款二维码.jpg"}],"wlm_text":"欢迎新人${username}入群。","wlm_image":false},{"nickname":"","type":102,"keywords":[{"keyword":"妮可","text":"大家好，我是妮可，想打麻将的自己进入房间，在群里喊人就好啦，群里打麻将的非常非常多，耐心等待，就有人来啦！"},{"keyword":"开房","text":"群内只允许在圈内打牌，目前圈内的4人房间有28129  三人房有74259 19695 62137 36456 31040 52552 14667"},{"keyword":"群规","text":"在“牌友圈”搜索ID“18774”申请加入，另：\n1.本群为牌乐门小额押金群，只打一毛一分白板麻将，群内打其他金额发生跑单现象概不退款。每8局结算，概不赊账。赊账者扣除押金T群处理。补齐欠款才可进群游戏。\n2.任何形式打“兄弟牌”，一经发现将踢群扣除押金.输钱后乱说别人作弊打通牌的不发图和证据并私自在群里乱说一通捣乱的一经发现立刻踢群扣除押金。\n3.请将“群昵称”和“游戏昵称”设为一致，方便识别，造成收付款出错后果自负。\n4.结账采用扫码支付，输家都统一扫给大赢家，大赢家支付5毛房费，大赢家扫给小赢家。群内禁止红包结算！\n5.不要私下同意任何人的欠帐。被跑单请第一时间发图说，我会负责。私下欠帐造成的损失，自行承担。\n6.游戏结束后，继续玩的请别退房间，不玩的请第一时间退出房间让别人进来。\n7.任何人中途挂机5分钟以上或者需中途退出，其他三家投票结算游戏，按最终系统结算的截图结算。\n8.群内再发其他圈外房间和其他游戏的，一次警告二次T群扣除押金\n9.群内只允许在圈内打牌，目前圈内的4人房间有28129 82181 三人房有74259 19695 62137 36456"},{"keyword":"打牌","text":"本群为牌乐门广东麻将诚信群【圈子18774】 ，欢迎大家来约牌\n【玩法】正宗推倒胡1底分6个码1分一毛，每8把按照输赢分数结算^O^\n【押金】新人进群交押金5元，退群退押金\n【结算】所有输家转账给大赢家，大赢家转账给其他赢家。全部扫码支付\n【房费】每局结束大赢家支付5毛房费，2元以下免收（含）\n下载地址：http://dwz.mn/AU"},{"keyword":"房费","text":"请大赢家扫描上面的二维码自觉交房费给群主！","image":"http://120.92.52.210:8000/storage/app/upload/1f5/2c1/ce9/李婕收款二维码.jpg"}]}]}`

	l := len([]byte(data))
	fmt.Println("len = ", l)

	body := strings.NewReader(data)

	req, err := http.NewRequest("POST", "http://localhost:8888/api/create", body)
	req.Header.Set("Content-Type", "application/json; charset=utf-8")

	//fmt.Println("req =", req)

	clinet := &http.Client{}
	resp, err := clinet.Do(req)
	if err != nil {
		fmt.Println("clinet.Do err =", err)
	}

	defer resp.Body.Close()
	ret, err := ioutil.ReadAll(resp.Body)
	fmt.Println(string(ret))
}
